# 1st program

print('Результат 1-й программы')
print(9**0.5*5)

#2st program

print('Результат 2-й программы')
print(9.99>9.98 and 1000!=1000.1)

#3st program

print('Результат 3-й программы')
print(2*2+2)
print(2*(2+2))
print(2*2+2==2*(2+2))

#4st program

print('Результат 4-й программы')
#Дана строка '123.456'
#Вывести на экран первую цифру после запятой - 4
float('123.456')
print(int(123.456 * 10) % 10)




